[{"source": "readme", "content": [{"Property": "host", "Type": "String", "Required?": "Yes", "Description": "Vertica host"}, {"Property": "port", "Type": "Integer", "Required?": "Yes", "Description": "Vertica port"}, {"Property": "user", "Type": "String", "Required?": "Yes", "Description": "Vertica user"}, {"Property": "password", "Type": "String", "Required?": "Yes", "Description": "Vertica password"}, {"Property": "dbname", "Type": "String", "Required?": "Yes", "Description": "Vertica database name"}, {"Property": "batch_size_rows", "Type": "Integer", "Required?": "", "Description": "(Default: 100000) Maximum number of rows in each batch. At the end of each batch, the rows in the batch are loaded into Vertica."}, {"Property": "flush_all_streams", "Type": "Boolean", "Required?": "", "Description": "(Default: False) Flush and load every stream into Vertica when one batch is full. Warning: This may trigger the COPY command to use files with low number of records."}, {"Property": "parallelism", "Type": "Integer", "Required?": "", "Description": "(Default: 0) The number of threads used to flush tables. 0 will create a thread for each stream, up to parallelism_max. -1 will create a thread for each CPU core. Any other positive number will create that number of threads, up to parallelism_max."}, {"Property": "max_parallelism", "Type": "Integer", "Required?": "", "Description": "(Default: 16) Max number of parallel threads to use when flushing tables."}, {"Property": "default_target_schema", "Type": "String", "Required?": "", "Description": "Name of the schema where the tables will be created. If schema_mapping is not defined then every stream sent by the tap is loaded into this schema."}, {"Property": "default_target_schema_select_permission", "Type": "String", "Required?": "", "Description": "Grant USAGE privilege on newly created schemas and grant SELECT privilege on newly created"}, {"Property": "schema_mapping", "Type": "Object", "Required?": "", "Description": "Useful if you want to load multiple streams from one tap to multiple Vertica schemas.If the tap sends the stream_id in <schema_name>-<table_name> format then this option overwrites the default_target_schema value. Note, that using schema_mapping you can overwrite the default_target_schema_select_permission value to grant SELECT permissions to different groups per schemas or optionally you can create indices automatically for the replicated tables. Note: This is an experimental feature and recommended to use via PipelineWise YAML files that will generate the object mapping in the right JSON format. For further info check a PipelineWise YAML Example."}, {"Property": "add_metadata_columns", "Type": "Boolean", "Required?": "", "Description": "(Default: False) Metadata columns add extra row level information about data ingestion's, (i.e. when was the row read in source, when was inserted or deleted in vertica etc.) Metadata columns are creating automatically by adding extra columns to the tables with a column prefix _SDC_. The column names are following the stitch naming conventions documented at https://www.stitchdata.com/docs/data-structure/integration-schemas#sdc-columns. Enabling metadata columns will flag the deleted rows by setting the _SDC_DELETED_AT metadata column. Without the add_metadata_columns option the deleted rows from singer taps will not be recognizable in Vertica."}, {"Property": "hard_delete", "Type": "Boolean", "Required?": "", "Description": "(Default: False) When hard_delete option is true then DELETE SQL commands will be performed in Vertica to delete rows in tables. It's achieved by continuously checking the _SDC_DELETED_AT metadata column sent by the singer tap. Due to deleting rows requires metadata columns, hard_delete option automatically enables the add_metadata_columns option as well."}, {"Property": "data_flattening_max_level", "Type": "Integer", "Required?": "", "Description": "(Default: 0) Object type RECORD items from taps can be transformed to flattened columns by creating columns automatically.When value is 0 (default) then flattening functionality is turned off."}, {"Property": "primary_key_required", "Type": "Boolean", "Required?": "", "Description": "(Default: True) Log based and Incremental replications on tables with no Primary Key cause duplicates when merging UPDATE events. When set to true, stop loading data if no Primary Key is defined."}, {"Property": "validate_records", "Type": "Boolean", "Required?": "", "Description": "(Default: False) Validate every single record message to the corresponding JSON schema. This option is disabled by default and invalid RECORD messages will fail only at load time by Vertica. Enabling this option will detect invalid records earlier but could cause performance degradation."}, {"Property": "temp_dir", "Type": "String", "Required?": "", "Description": "(Default: platform-dependent) Directory of temporary CSV files with RECORD messages."}], "instance": 0}]