[{"source": "readme", "content": [{"Setting": "database", "Type": "string", "Required": true, "Default": "-", "Description": "Database from which records will be extracted."}, {"Setting": "mongodb_connection_string", "Type": "password", "Required": false, "Default": "-", "Description": "MongoDB connection string. See the MongoDB documentation for specification. The username and password included in this string must be url-encoded - the tap will not url-encode it."}, {"Setting": "documentdb_credential_json_string", "Type": "password", "Required": false, "Default": "-", "Description": "JSON string with keys 'username', 'password', 'engine', 'host', 'port', 'dbClusterIdentifier' or 'dbName', 'ssl'. See example and strucure in the AWS documentation here. The password from this JSON object will be url-encoded by the tap before opening the database connection. The intent of this setting is to enable management of an AWS DocumentDB database credential via AWS SecretsManager"}, {"Setting": "documentdb_credential_json_extra_options", "Type": "string", "Required": false, "Default": "-", "Description": "JSON string containing key-value pairs which will be added to the connection string options when using documentdb_credential_json_string. For example, when set to the string {\"tls\":\"true\",\"tlsCAFile\":\"my-ca-bundle.pem\"}, the options tls=true&tlsCAFile=my-ca-bundle.pem will be passed to the MongoClient."}, {"Setting": "datetime_conversion", "Type": "string", "Required": false, "Default": "datetime", "Description": "Parameter passed to MongoClient 'datetime_conversion' parameter. See documentation at https://pymongo.readthedocs.io/en/stable/examples/datetimes.html#handling-out-of-range-datetimes for details. The default value is 'datetime', which will throw a bson.errors.InvalidBson error if a document contains a date outside the range of datetime.MINYEAR (year 1) to datetime.MAXYEAR (9999)."}, {"Setting": "prefix", "Type": "string", "Required": false, "Default": "''", "Description": "An optional prefix which will be added to the name of each stream."}, {"Setting": "start_date", "Type": "date_iso8601", "Required": false, "Default": "1970-01-01", "Description": "Start date - used for incremental replication only. In log-based replication mode, this setting is ignored."}, {"Setting": "add_record_metadata", "Type": "boolean", "Required": false, "Default": "False", "Description": "When true, _sdc metadata fields will be added to records produced by the tap."}, {"Setting": "allow_modify_change_streams", "Type": "boolean", "Required": false, "Default": "False", "Description": "In AWS DocumentDB (unlike MongoDB), change streams must be enabled specifically (see the documentation here ). If attempting to open a change stream against a collection on which change streams have not been enabled, an OperationFailure error will be raised. If this property is set to True, when this error is seen, the tap will execute an admin command to enable change streams and then retry the read operation. Note: this may incur new costs in AWS DocumentDB."}, {"Setting": "operation_types", "Type": "list(string)", "Required": false, "Default": "create,delete,insert,replace,update", "Description": "List of MongoDB change stream operation types to include in tap output. The default behavior is to limit to document-level operation types. See full list of operation types in the MongoDB documentation. Note that the list of allowed_values for this property includes some values not available to all MongoDB versions."}], "instance": 0}]